/*
 * *
 *  @Author anderyly
 *  @email admin@aaayun.cc
 *  @link http://blog.aaayun.cc/
 *  @copyright Copyright (c) 2022
 *  *
 */

package common

import "math"

type TenGodModel struct {
}

var ten = map[string]string{
	"正印": "印",
	"偏印": "枭",
	"比肩": "比",
	"劫财": "劫",
	"食神": "食",
	"伤官": "伤",
	"正财": "财",
	"偏财": "才",
	"正官": "官",
	"七杀": "杀",
}

/**
 * @param $tg [天干]
 * @param $rz [日支]
 * @return string
 */
func (con TenGodModel) Get(tg, rz, pix int) string {
	if rz == 0 {
		rz = 10
	}
	if tg == 0 {
		tg = 10
	}

	cha := rz - tg

	str := ""
	if cha >= 0 {

		switch cha {
		case 0:
			str = "比肩"
		case 1:
			if rz%2 == 0 {
				str = "劫财"
			} else {
				str = "正印"
			}
		case 2:
			str = "偏印"
		case 3:
			if rz%2 == 0 {
				str = "正印"
			} else {
				str = "正官"
			}
		case 4:
			str = "七杀" // 偏官
		case 5:
			if rz%2 == 0 {
				str = "正官"
			} else {
				str = "正财"
			}
		case 6:
			str = "偏财"
		case 7:
			if rz%2 == 0 {
				str = "正财"
			} else {
				str = "伤官"
			}
		case 8:
			str = "食神"
		case 9:
			str = "伤官"
		}
	} else {
		switch math.Abs(float64(cha)) {
		case 1:
			if rz%2 == 1 {
				str = "劫财"
			} else {
				str = "伤官"
			}
		case 2:
			str = "食神"
		case 3:
			if rz%2 == 1 {
				str = "伤官"
			} else {
				str = "正财"
			}
		case 4:
			str = "偏财"
		case 5:
			if rz%2 == 1 {
				str = "正财"
			} else {
				str = "正官"
			}
		case 6:
			str = "七杀"
		case 7:
			if rz%2 == 1 {
				str = "正官"
			} else {
				str = "正印"
			}
		case 8:
			str = "偏印"
		case 9:
			str = "正印"
		}
	}
	if pix == 0 {
		return str
	} else {
		return ten[str]
	}
}

/**
 * @param $dz [地支]
 * @param $rg [日干]
 * @return string
 */
func (con TenGodModel) Zhi(dz, rg string, pix int) string {
	arr := map[string]map[string]string{
		"甲": {
			"子": "正印",
			"亥": "偏印",
			"寅": "比肩",
			"卯": "劫财",
			"巳": "食神",
			"午": "伤官",
			"丑": "正财",
			"未": "正财",
			"辰": "偏财",
			"戌": "偏财",
			"酉": "正官",
			"申": "七杀",
		},
		"乙": {
			"子": "偏印",
			"亥": "正印",
			"寅": "劫财",
			"卯": "比肩",
			"巳": "伤官",
			"午": "食神",
			"丑": "偏财",
			"未": "偏财",
			"辰": "正财",
			"戌": "正财",
			"酉": "七杀",
			"申": "正官",
		},
		"丙": {
			"子": "正官",
			"亥": "七杀",
			"寅": "偏印",
			"卯": "正印",
			"巳": "比肩",
			"午": "劫财",
			"丑": "伤官",
			"未": "伤官",
			"辰": "食神",
			"戌": "食神",
			"酉": "正财",
			"申": "偏财",
		},
		"丁": {
			"子": "七杀",
			"亥": "正官",
			"寅": "正印",
			"卯": "偏印",
			"巳": "劫财",
			"午": "比肩",
			"丑": "食神",
			"未": "食神",
			"辰": "伤官",
			"戌": "伤官",
			"酉": "偏财",
			"申": "正财",
		},
		"戊": {
			"子": "正财",
			"亥": "偏财",
			"寅": "七杀",
			"卯": "正官",
			"巳": "偏印",
			"午": "正印",
			"丑": "劫财",
			"未": "劫财",
			"辰": "比肩",
			"戌": "比肩",
			"酉": "伤官",
			"申": "食神",
		},
		"己": {
			"子": "偏财",
			"亥": "正财",
			"寅": "正官",
			"卯": "七杀",
			"巳": "正印",
			"午": "偏印",
			"丑": "比肩",
			"未": "比肩",
			"辰": "劫财",
			"戌": "劫财",
			"酉": "食神",
			"申": "伤官",
		},
		"庚": {
			"子": "伤官",
			"亥": "食神",
			"寅": "偏财",
			"卯": "正财",
			"巳": "七杀",
			"午": "正官",
			"丑": "正印",
			"未": "正印",
			"辰": "偏印",
			"戌": "偏印",
			"酉": "劫财",
			"申": "比肩",
		},
		"辛": {
			"子": "食神",
			"亥": "伤官",
			"寅": "正财",
			"卯": "偏财",
			"巳": "正官",
			"午": "七杀",
			"丑": "偏印",
			"未": "偏印",
			"辰": "正印",
			"戌": "正印",
			"酉": "比肩",
			"申": "劫财",
		},
		"壬": {
			"子": "劫财",
			"亥": "比肩",
			"寅": "食神",
			"卯": "伤官",
			"巳": "偏财",
			"午": "正财",
			"丑": "正官",
			"未": "正官",
			"辰": "七杀",
			"戌": "七杀",
			"酉": "正印",
			"申": "偏印",
		},
		"癸": {
			"子": "比肩",
			"亥": "劫财",
			"寅": "伤官",
			"卯": "食神",
			"巳": "正财",
			"午": "偏财",
			"丑": "七杀",
			"未": "七杀",
			"辰": "正官",
			"戌": "正官",
			"酉": "偏印",
			"申": "正印",
		},
	}

	if pix == 0 {
		return arr[rg][dz]
	} else {
		return ten[arr[rg][dz]]
	}

}
